app/Services/ChatGPTService.php

    public function explainWrongAnswer(string $question, string $wrongAnswer, string $correctAnswer, ?string $lang = null): string
    {
        $key = config('services.chatgpt.key');
        if (empty($key)) {
            Log::warning('ChatGPT API key not configured');
            return '';
        }

        $lang = "ua";//$lang ?? config('services.chatgpt.language', 'ua');

        $cached = ChatGPTExplanation::where('question', $question)
            ->where('wrong_answer', $wrongAnswer)
            ->where('correct_answer', $correctAnswer)
            ->where('language', $lang)
            ->first();
---
select * from `chatgpt_explanations` where `question` = 'If you {a1} to my birthday party tonight, I {a2} very upset. I want you to come!' and `wrong_answer` = 'am' and `correct_answer` = 'don\'t come' and `language` = 'ua' limit 1