app/Services/GrammarTestFilterService.php

    public function prepare(array $input): array
    {
        $filters = $this->normalize($input);

        $categories = Category::all();
---
select * from `categories`

        $autoTestName = ucwords($categoryNames->join(' - '));

        $sources = Schema::hasTable('sources')
            ? Source::orderBy('name')->get()
            : collect();

        $allTags = Schema::hasTable('tags')
            ? Tag::whereHas('questions')->get()
            : collect();

        $order = array_flip(['A1','A2','B1','B2','C1','C2']);
        $levels = Question::select('level')->distinct()->pluck('level')
            ->filter()
            ->sortBy(fn($lvl) => $order[$lvl] ?? 99)
            ->values();

        $seederClasses = Schema::hasColumn('questions', 'seeder')
            ? Question::query()
                ->select('seeder')
                ->whereNotNull('seeder')
                ->distinct()
                ->orderBy('seeder')
                ->pluck('seeder')
                ->values()
---
select * from `sources` order by `name` asc
select * from `tags` where exists (select * from `questions` inner join `question_tag` on `questions`.`id` = `question_tag`.`question_id` where `tags`.`id` = `question_tag`.`tag_id`)
select distinct `level` from `questions`
select distinct `seeder` from `questions` where `seeder` is not null order by `seeder` asc

    public function seederSourceGroups(): Collection
    {
        if (! Schema::hasColumn('questions', 'seeder')) {
            return collect();
        }

        $pairs = Question::query()
            ->select('seeder', 'source_id')
            ->whereNotNull('seeder')
            ->groupBy('seeder', 'source_id')
            ->get();

        if ($pairs->isEmpty()) {
            return collect();
        }

        $sourceIds = $pairs->pluck('source_id')
            ->filter()
            ->unique()
            ->values();

        $sources = $sourceIds->isEmpty()
            ? collect()
            : Source::whereIn('id', $sourceIds)
                ->orderByDesc('id')
                ->get()
                ->keyBy('id');
---
select `seeder`, `source_id` from `questions` where `seeder` is not null group by `seeder`, `source_id`
select * from `sources` where `id` in (232, 233, 234, 235, 236, 237, 244, 245, 246, 247, 213, 214, 215, 216, 217, 218, 250, 225, 211, 212, 219, 220, 221, 222, 238, 254, 255, 256, 210, 223) order by `id` desc