app/Services/QuestionSeedingService.php

insert into `question_option_question` (`flag`, `option_id`, `question_id`) values (null, 7362, 5463)
select exists(select * from `question_option_question` where `question_id` = 5463 and `option_id` = 7362 and (`flag` is null)) as `exists`
---
    private function attachOption(Question $question, string $value, ?int $flag = null): QuestionOption
    {
        $option = QuestionOption::firstOrCreate(['option' => $value]);

        $exists = DB::table('question_option_question')
            ->where('question_id', $question->id)
            ->where('option_id', $option->id)
            ->where(function ($query) use ($flag) {
                if ($flag === null) {
                    $query->whereNull('flag');
                } else {
                    $query->where('flag', $flag);
                }
            })
            ->exists();

insert into `questions` (`uuid`, `question`, `category_id`, `difficulty`, `source_id`, `flag`, `level`, `seeder`, `updated_at`, `created_at`) values ('1-youd-better-not-a1-this-product-wi', 'You\'d better not {a1} this product without protection.', 37, 4, 254, 0, 'B2', 'Database\\Seeders\\V2\\Modals\\ModalObligationNecessityV2Seeder', '2025-10-24 16:59:35', '2025-10-24 16:59:35')
---
    public function seed(array $items, bool $allowQuestionTextFallback = true): void
    {
        $defaultSeederClass = $this->detectSeederClassName();

        foreach ($items as $data) {
            if (array_key_exists('uuid', $data)) {
                $data['uuid'] = app(QuestionUuidResolver::class)->toPersistent((string) $data['uuid']);
            }

            DB::transaction(function () use ($data, $defaultSeederClass, $allowQuestionTextFallback) {
                $seederClass = $data['seeder'] ?? $defaultSeederClass;

                $question = $this->locateExistingQuestion($data, $allowQuestionTextFallback);

                if (! empty($data['category_id'])) {
                    $this->ensureCategoryExists((int) $data['category_id']);
                }

                $attributes = $this->buildQuestionAttributes($data, $seederClass);

                if ($question) {
                    $question->forceFill($attributes)->save();
                    $this->recreateQuestionRelations($question, $data);

                    return;
                }

                $question = Question::create($attributes);
                $this->recreateQuestionRelations($question, $data);
            });