app/Services/QuestionDeletionService.php

    public function deleteQuestion(Question $question): QuestionDeletionResult
    {
        $questionUuid = (string) $question->uuid;
        $categoryId = $question->category_id;
        $sourceId = $question->source_id;

        $questionText = trim((string) $question->question);
        $hasDuplicateText = $questionText !== '' && Question::query()
            ->where('id', '!=', $question->id)
            ->where('question', $questionText)
            ->exists();

        $optionIds = collect();

        if (Schema::hasTable('question_option_question')) {
            $optionIds = $optionIds->merge(
                DB::table('question_option_question')
                    ->where('question_id', $question->id)
                    ->pluck('option_id')
            );

            DB::table('question_option_question')
                ->where('question_id', $question->id)
                ->delete();
        }

        if (Schema::hasTable('question_answers') && Schema::hasColumn('question_answers', 'option_id')) {
            $optionIds = $optionIds->merge(
                QuestionAnswer::query()
                    ->where('question_id', $question->id)
                    ->pluck('option_id')
            );

            QuestionAnswer::query()
                ->where('question_id', $question->id)
                ->delete();
        }

        if (Schema::hasTable('verb_hints') && Schema::hasColumn('verb_hints', 'option_id')) {
            $optionIds = $optionIds->merge(
                VerbHint::query()
                    ->where('question_id', $question->id)
                    ->pluck('option_id')
            );

            VerbHint::query()
                ->where('question_id', $question->id)
                ->delete();
        }

        if (Schema::hasTable('question_hints')) {
            QuestionHint::query()
                ->where('question_id', $question->id)
                ->delete();
        }

        if (Schema::hasTable('question_variants')) {
            QuestionVariant::query()
                ->where('question_id', $question->id)
                ->delete();
        }

        if (Schema::hasTable('tags') && Schema::hasTable('question_tag')) {
            $question->tags()->detach();
---
select exists(select * from `questions` where `id` != 5435 and `question` = 'You\'d better not {a1} this product without protection.') as `exists`
select `option_id` from `question_option_question` where `question_id` = 5435
delete from `question_option_question` where `question_id` = 5435
select `option_id` from `question_answers` where `question_id` = 5435
delete from `question_answers` where `question_id` = 5435
select `option_id` from `verb_hints` where `question_id` = 5435
delete from `verb_hints` where `question_id` = 5435
delete from `question_hints` where `question_id` = 5435
delete from `question_variants` where `question_id` = 5435
delete from `question_tag` where `question_tag`.`question_id` = 5435
delete from `questions` where `id` = 5435

        $question->delete();

        if ($questionText !== '' && Schema::hasTable('chatgpt_explanations') && ! $hasDuplicateText) {
            ChatGPTExplanation::query()
                ->where('question', $questionText)
                ->delete();
---
delete from `chatgpt_explanations` where `question` = 'You\'d better not {a1} this product without protection.'

    private function deleteUnusedOptions(Collection $optionIds): void
    {
        $optionIds->filter()
            ->unique()
            ->each(function ($optionId) {
                $stillUsed = (Schema::hasTable('question_answers')
                        && Schema::hasColumn('question_answers', 'option_id')
                        && QuestionAnswer::query()->where('option_id', $optionId)->exists())
                    || (Schema::hasTable('verb_hints')
                        && Schema::hasColumn('verb_hints', 'option_id')
                        && VerbHint::query()->where('option_id', $optionId)->exists())
                    || (Schema::hasTable('question_option_question')
                        && DB::table('question_option_question')->where('option_id', $optionId)->exists());

                if (! $stillUsed) {
                    QuestionOption::query()->where('id', $optionId)->delete();
                }
            });
---
select exists(select * from `question_answers` where `option_id` = 7267) as `exists`
select exists(select * from `verb_hints` where `option_id` = 7267) as `exists`
select exists(select * from `question_option_question` where `option_id` = 7267) as `exists`
delete from `question_options` where `id` = 7267

    private function pruneUnusedCategoryAndSource(?int $categoryId, ?int $sourceId): void
    {
        if ($categoryId && Schema::hasTable('categories')) {
            $hasQuestions = Question::query()->where('category_id', $categoryId)->exists();

            if (! $hasQuestions) {
                Category::query()->whereKey($categoryId)->delete();
            }
        }

        if ($sourceId && Schema::hasTable('sources')) {
            $hasQuestions = Question::query()->where('source_id', $sourceId)->exists();
---
select exists(select * from `questions` where `category_id` = 36) as `exists`
select exists(select * from `questions` where `source_id` = 251) as `exists`