app/Services/SavedTestResolver.php

    public function resolve(string $slug): ResolvedSavedTest
    {
        $lookupSlug = SentenceBuilderBranding::legacyLessonSlug($slug);
        $legacy = Test::where('slug', $lookupSlug)->first();

        if ($legacy) {
            $this->decoratePublicBranding($legacy);

            $questionIds = collect($legacy->questions ?? [])
                ->filter(fn ($id) => filled($id))
                ->map(fn ($id) => (int) $id)
                ->values();

            $uuidMap = $questionIds->isEmpty()
                ? collect()
                : Question::whereIn('id', $questionIds)->pluck('uuid', 'id');

            $questionUuids = $questionIds
                ->map(fn ($id) => $uuidMap[$id] ?? null)
                ->filter()
                ->values();

            return new ResolvedSavedTest($legacy, $questionIds, $questionUuids, false);
        }

        $saved = SavedGrammarTest::with('questionLinks')->where('slug', $lookupSlug)->first();
---
select * from `tests` where `slug` = 'question-words-1' limit 1
select * from `saved_grammar_tests` where `slug` = 'question-words-1' limit 1

    private function resolveFromModel(SavedGrammarTest $saved): ResolvedSavedTest
    {
        $rawFilters = $saved->filters ?? [];
        if (is_string($rawFilters)) {
            $decoded = json_decode($rawFilters, true);
            $rawFilters = is_array($decoded) ? $decoded : [];
        }

        $isFilterBased = is_array($rawFilters)
            && Arr::get($rawFilters, '__meta.mode') === 'filters';

        if ($isFilterBased) {
            $normalized = $this->filterService->normalize($rawFilters);
            $questions = $this->filterService->questionsFromFilters($normalized);

            $questionIds = $questions->pluck('id')
                ->filter(fn ($id) => filled($id))
                ->map(fn ($id) => (int) $id)
                ->values();

            $questionUuids = $questions->pluck('uuid')
                ->filter(fn ($uuid) => filled($uuid))
                ->values();
---
select `id`, `uuid` from `questions` where `uuid` in ('questionwordsdragdropseeder-1', 'questionwordsdragdropseeder-2', 'questionwordsdragdropseeder-3', 'questionwordsdragdropseeder-4', 'questionwordsdragdropseeder-5', 'questionwordsdragdropseeder-6', 'questionwordsdragdropseeder-7', 'questionwordsdragdropseeder-8', 'questionwordsdragdropseeder-9', 'questionwordsdragdropseeder-10', 'questionwordsdragdropseeder-11', 'questionwordsdragdropseeder-12', 'questionwordsdragdropseeder-13', 'questionwordsdragdropseeder-14', 'questionwordsdragdropseeder-15', 'questionwordsdragdropseeder-16', 'questionwordsdragdropseeder-17', 'questionwordsdragdropseeder-18', 'questionwordsdragdropseeder-19', 'questionwordsdragdropseeder-20', 'questionwordsdragdropseeder-21', 'questionwordsdragdropseeder-22', 'questionwordsdragdropseeder-23', 'questionwordsdragdropseeder-24', 'questionwordsdragdropseeder-25', 'questionwordsdragdropseeder-26', 'questionwordsdragdropseeder-27', 'questionwordsdragdropseeder-28')