database/seeders/V2/modals/ModalObligationNecessityV2Seeder.php

    public function run(): void
    {
        $categoryId = Category::firstOrCreate(['name' => 'Modal Verbs Obligation Practice V2'])->id;
        $sourceIds = [
            'exercise1' => Source::firstOrCreate(['name' => 'Custom: Modal Verbs Obligation Practice V2 - Exercise 1'])->id,
            'exercise2' => Source::firstOrCreate(['name' => 'Custom: Modal Verbs Obligation Practice V2 - Exercise 2'])->id,
            'exercise3' => Source::firstOrCreate(['name' => 'Custom: Modal Verbs Obligation Practice V2 - Exercise 3'])->id,
        ];

        $defaultSourceId = reset($sourceIds);

        $themeTagId = Tag::firstOrCreate(
            ['name' => 'Modal Verbs Practice'],
            ['category' => 'English Grammar Theme']
        )->id;

        $modalsTagId = Tag::firstOrCreate(
            ['name' => 'Modal Verbs'],
            ['category' => 'Modals']
        )->id;

        $detailTags = [
            'expectation' => Tag::firstOrCreate(['name' => 'Modal Expectation Focus'], ['category' => 'English Grammar Detail'])->id,
            'lack_obligation' => Tag::firstOrCreate(['name' => 'Modal No Obligation Focus'], ['category' => 'English Grammar Detail'])->id,
            'regret' => Tag::firstOrCreate(['name' => 'Modal Regret Focus'], ['category' => 'English Grammar Detail'])->id,
            'permission' => Tag::firstOrCreate(['name' => 'Modal Permission Focus'], ['category' => 'English Grammar Detail'])->id,
            'necessity' => Tag::firstOrCreate(['name' => 'Modal Necessity Focus'], ['category' => 'English Grammar Detail'])->id,
            'advice' => Tag::firstOrCreate(['name' => 'Modal Advice Focus'], ['category' => 'English Grammar Detail'])->id,
            'prohibition' => Tag::firstOrCreate(['name' => 'Modal Prohibition Focus'], ['category' => 'English Grammar Detail'])->id,
            'obligation' => Tag::firstOrCreate(['name' => 'Modal Obligation Focus'], ['category' => 'English Grammar Detail'])->id,
        ];

        $structureTags = [
            'be_supposed_to' => Tag::firstOrCreate(['name' => 'Structure: be supposed/meant to'], ['category' => 'English Grammar Structure'])->id,
            'no_obligation' => Tag::firstOrCreate(['name' => 'Structure: no obligation forms'], ['category' => 'English Grammar Structure'])->id,
            'neednt_have' => Tag::firstOrCreate(['name' => "Structure: needn't have + V3"], ['category' => 'English Grammar Structure'])->id,
            'should_have' => Tag::firstOrCreate(['name' => 'Structure: should / ought to have + V3'], ['category' => 'English Grammar Structure'])->id,
            'be_allowed_to' => Tag::firstOrCreate(['name' => 'Structure: be allowed/permitted to'], ['category' => 'English Grammar Structure'])->id,
            'allowed_status' => Tag::firstOrCreate(['name' => 'Structure: allowed/permitted status'], ['category' => 'English Grammar Structure'])->id,
            'had_to' => Tag::firstOrCreate(['name' => 'Structure: had to / needed to'], ['category' => 'English Grammar Structure'])->id,
            'mustnt' => Tag::firstOrCreate(['name' => "Structure: mustn't"], ['category' => 'English Grammar Structure'])->id,
            'had_better' => Tag::firstOrCreate(['name' => 'Structure: had better'], ['category' => 'English Grammar Structure'])->id,
            'need_to' => Tag::firstOrCreate(['name' => 'Structure: need / have to'], ['category' => 'English Grammar Structure'])->id,
            'should_ought_to' => Tag::firstOrCreate(['name' => 'Structure: should / ought to'], ['category' => 'English Grammar Structure'])->id,
        ];
---
insert into `categories` (`name`, `updated_at`, `created_at`) values ('Modal Verbs Obligation Practice V2', '2025-10-24 16:59:34', '2025-10-24 16:59:34')
select * from `categories` where (`name` = 'Modal Verbs Obligation Practice V2') limit 1
select * from `sources` where (`name` = 'Custom: Modal Verbs Obligation Practice V2 - Exercise 3') limit 1
insert into `sources` (`name`, `updated_at`, `created_at`) values ('Custom: Modal Verbs Obligation Practice V2 - Exercise 2', '2025-10-24 16:59:34', '2025-10-24 16:59:34')
select * from `sources` where (`name` = 'Custom: Modal Verbs Obligation Practice V2 - Exercise 1') limit 1
insert into `sources` (`name`, `updated_at`, `created_at`) values ('Custom: Modal Verbs Obligation Practice V2 - Exercise 3', '2025-10-24 16:59:34', '2025-10-24 16:59:34')
select * from `sources` where (`name` = 'Custom: Modal Verbs Obligation Practice V2 - Exercise 2') limit 1
select * from `tags` where (`name` = 'Modal Verbs Practice') limit 1
select * from `tags` where (`name` = 'Modal Verbs') limit 1
select * from `tags` where (`name` = 'Modal Obligation Focus') limit 1
select * from `tags` where (`name` = 'Modal Expectation Focus') limit 1
select * from `tags` where (`name` = 'Modal No Obligation Focus') limit 1
select * from `tags` where (`name` = 'Modal Regret Focus') limit 1
select * from `tags` where (`name` = 'Modal Permission Focus') limit 1
select * from `tags` where (`name` = 'Modal Necessity Focus') limit 1
select * from `tags` where (`name` = 'Modal Advice Focus') limit 1
select * from `tags` where (`name` = 'Modal Prohibition Focus') limit 1
select * from `tags` where (`name` = 'Structure: should / ought to') limit 1
select * from `tags` where (`name` = 'Structure: be supposed/meant to') limit 1
select * from `tags` where (`name` = 'Structure: no obligation forms') limit 1
select * from `tags` where (`name` = 'Structure: needn\'t have + V3') limit 1
select * from `tags` where (`name` = 'Structure: should / ought to have + V3') limit 1
select * from `tags` where (`name` = 'Structure: be allowed/permitted to') limit 1
select * from `tags` where (`name` = 'Structure: allowed/permitted status') limit 1
select * from `tags` where (`name` = 'Structure: had to / needed to') limit 1
select * from `tags` where (`name` = 'Structure: mustn\'t') limit 1
select * from `tags` where (`name` = 'Structure: had better') limit 1
select * from `tags` where (`name` = 'Structure: need / have to') limit 1