database/seeders/V2/ConditionalsMixedPracticeV2Seeder.php

select * from `categories` where (`name` = 'Conditionals') limit 1
insert into `sources` (`name`, `updated_at`, `created_at`) values ('Custom: Mixed Conditionals Practice V2', '2025-10-25 15:39:52', '2025-10-25 15:39:52')
select * from `sources` where (`name` = 'Custom: Mixed Conditionals Practice V2') limit 1
select * from `tags` where (`name` = 'Mixed Conditionals Practice') limit 1
select * from `tags` where (`name` = 'Mixed Conditional Sentence Completion') limit 1
select * from `tags` where (`name` = 'Conditional Sentences Type 1-3') limit 1
select * from `tags` where (`name` = 'First Conditional') limit 1
select * from `tags` where (`name` = 'Second Conditional') limit 1
select * from `tags` where (`name` = 'Third Conditional') limit 1
---
    public function run(): void
    {
        $categoryId = Category::firstOrCreate(['name' => 'Conditionals'])->id;
        $sourceId = Source::firstOrCreate(['name' => 'Custom: Mixed Conditionals Practice V2'])->id;

        $themeTagId = Tag::firstOrCreate(
            ['name' => 'Mixed Conditionals Practice'],
            ['category' => 'English Grammar Theme']
        )->id;

        $detailTagId = Tag::firstOrCreate(
            ['name' => 'Mixed Conditional Sentence Completion'],
            ['category' => 'English Grammar Detail']
        )->id;

        $structureTagId = Tag::firstOrCreate(
            ['name' => 'Conditional Sentences Type 1-3'],
            ['category' => 'English Grammar Structure']
        )->id;

        $tenseTagIds = [
            'First Conditional' => Tag::firstOrCreate(['name' => 'First Conditional'], ['category' => 'Tenses'])->id,
            'Second Conditional' => Tag::firstOrCreate(['name' => 'Second Conditional'], ['category' => 'Tenses'])->id,
            'Third Conditional' => Tag::firstOrCreate(['name' => 'Third Conditional'], ['category' => 'Tenses'])->id,
        ];