app/Support/Database/Seeder.php

    protected function shouldRun(): bool
    {
        if (!Schema::hasTable('seed_runs')) {
            return true;
        }

        return !DB::table('seed_runs')
            ->where('class_name', static::class)
            ->exists();
---
select exists(select * from `seed_runs` where `class_name` = 'Database\\Seeders\\V2\\Modals\\ModalObligationNecessityV2Seeder') as `exists`