app/Http/Controllers/DeploymentController.php

insert into `backup_branches` (`name`, `commit_hash`, `pushed_at`, `updated_at`, `created_at`) values ('beckup-before-optimization', '830f4274e7533afd85ba31ef93cf113d9f4f2556', null, '2025-10-24 17:00:40', '2025-10-24 17:00:40')
select * from `backup_branches` where (`name` = 'beckup-before-optimization') limit 1
---
            return $this->redirectWithFeedback('error', 'Не вдалося створити резервну гілку.', $commandsOutput);
        }

        BackupBranch::updateOrCreate(
            ['name' => $branchName],
            [
                'commit_hash' => $resolvedCommit,
                'pushed_at' => null,
            ]
        );

update `backup_branches` set `pushed_at` = '2025-10-24 19:26:25', `backup_branches`.`updated_at` = '2025-10-24 19:26:25' where `id` = 11
---
    public function pushBackupBranch(BackupBranch $backupBranch): RedirectResponse
    {
        $repoPath = base_path();
        $commandsOutput = [];

        $branchCheck = $this->runCommand(['git', 'branch', '--list', $backupBranch->name], $repoPath);
        $commandsOutput[] = $this->formatProcess("git branch --list {$backupBranch->name}", $branchCheck);

        if (! $branchCheck->isSuccessful()) {
            return $this->redirectWithFeedback('error', 'Не вдалося перевірити наявність гілки.', $commandsOutput);
        }

        if (trim($branchCheck->getOutput()) === '') {
            return $this->redirectWithFeedback('error', 'Резервної гілки не знайдено у локальному репозиторії.', $commandsOutput);
        }

        $pushProcess = $this->runCommand(['git', 'push', 'origin', $backupBranch->name], $repoPath);
        $commandsOutput[] = $this->formatProcess("git push origin {$backupBranch->name}", $pushProcess);

        if (! $pushProcess->isSuccessful()) {
            return $this->redirectWithFeedback('error', 'Не вдалося запушити резервну гілку на GitHub.', $commandsOutput);
        }

        $backupBranch->forceFill(['pushed_at' => now()])->save();