app/Http/Controllers/DeploymentController.php

update `backup_branches` set `pushed_at` = '2025-10-25 12:15:16', `backup_branches`.`updated_at` = '2025-10-25 12:15:16' where `id` = 19
---
    public function pushBackupBranch(BackupBranch $backupBranch): RedirectResponse
    {
        if ($redirect = $this->redirectIfShellUnavailable($backupBranch->name)) {
            return $redirect;
        }

        $repoPath = base_path();
        $commandsOutput = [];

        $branchCheck = $this->runCommand(['git', 'branch', '--list', $backupBranch->name], $repoPath);
        $commandsOutput[] = $this->formatProcess("git branch --list {$backupBranch->name}", $branchCheck);

        if (! $branchCheck->isSuccessful()) {
            return $this->redirectWithFeedback('error', 'Не вдалося перевірити наявність гілки.', $commandsOutput);
        }

        if (trim($branchCheck->getOutput()) === '') {
            return $this->redirectWithFeedback('error', 'Резервної гілки не знайдено у локальному репозиторії.', $commandsOutput);
        }

        $pushProcess = $this->runCommand(['git', 'push', 'origin', $backupBranch->name], $repoPath);
        $commandsOutput[] = $this->formatProcess("git push origin {$backupBranch->name}", $pushProcess);

        if (! $pushProcess->isSuccessful()) {
            return $this->redirectWithFeedback('error', 'Не вдалося запушити резервну гілку на GitHub.', $commandsOutput);
        }

        $backupBranch->forceFill(['pushed_at' => now()])->save();