app/Http/Controllers/DeploymentGitHubController.php

    public function index(): View
    {
        $service = $this->manager();
        $backups = array_reverse($this->loadBackups());
        $feedback = session('deployment_github');
        $backupBranches = BackupBranch::query()->orderByDesc('created_at')->get();
---
select * from `backup_branches` order by `created_at` desc

    public function createBackupBranch(Request $request): RedirectResponse
    {
        $branchName = Str::of($request->input('branch_name', ''))->trim()->value();
        $branchName = preg_replace('/[^A-Za-z0-9_\-\.\/]/', '', $branchName);
        if ($branchName === '') {
            return $this->redirectWithFeedback('error', 'Вкажіть коректну назву гілки для резервного бекапу.', []);
        }

        $commitInput = Str::of($request->input('commit', 'current'))->trim()->value();
        $service = $this->manager();

        if ($commitInput !== 'current' && ! preg_match('/^[0-9a-f]{7,40}$/i', $commitInput)) {
            return $this->redirectWithFeedback('error', 'Невірний формат коміту для створення гілки.', []);
        }

        $steps = [];
        $commitSha = $commitInput === 'current'
            ? $service->getCurrentCommit()
            : $commitInput;

        if (! $commitSha) {
            return $this->redirectWithFeedback('error', 'Не вдалося визначити коміт для створення гілки.', []);
        }

        try {
            $service->createBackupBranch($branchName, $commitSha, $steps);
        } catch (Throwable $e) {
            return $this->redirectWithFeedback('error', $e->getMessage(), $steps);
        }

        BackupBranch::updateOrCreate(
            ['name' => $branchName],
            [
                'commit_hash' => $commitSha,
                'pushed_at' => now(),
            ]
        );
---
insert into `backup_branches` (`name`, `commit_hash`, `pushed_at`, `updated_at`, `created_at`) values ('test-gh-api', '6e4bc4ededa8495ec2a317ee066a4cc5e8648639', '2025-10-25 11:16:09', '2025-10-25 11:16:10', '2025-10-25 11:16:10')
select * from `backup_branches` where (`name` = 'test-gh-api') limit 1