app/Http/Controllers/DeploymentController.php

    public function index()
    {
        $backups = array_reverse($this->loadBackups());
        $feedback = session('deployment');

        $backupBranches = BackupBranch::query()
            ->orderByDesc('created_at')
            ->get();
---
select * from `backup_branches` order by `created_at` desc

            return $this->redirectWithFeedback('error', 'Не вдалося створити резервну гілку.', $commandsOutput);
        }

        BackupBranch::updateOrCreate(
            ['name' => $branchName],
            [
                'commit_hash' => $resolvedCommit,
                'pushed_at' => null,
            ]
        );
---
insert into `backup_branches` (`name`, `commit_hash`, `pushed_at`, `updated_at`, `created_at`) values ('bk-before-git-fix', 'c5b46b27fac1489e4bb671e1358f179c280bc51c', null, '2025-10-24 21:06:26', '2025-10-24 21:06:26')
select * from `backup_branches` where (`name` = 'bk-before-git-fix') limit 1