app/Http/Controllers/GrammarTestController.php

select distinct `provider` from `question_hints` order by `provider` asc
---
        $hintProviders = [];

        if (Schema::hasTable('question_hints')) {
            $hintProviders = QuestionHint::query()
                ->select('provider')
                ->distinct()
                ->orderBy('provider')
                ->pluck('provider')
                ->filter(fn ($provider) => is_string($provider) && trim($provider) !== '')
                ->values()
                ->all();

select * from `tags` where exists (select * from `questions` inner join `question_tag` on `questions`.`id` = `question_tag`.`question_id` where `tags`.`id` = `question_tag`.`tag_id`)
---
    public function catalogAggregated(Request $request)
    {
        $selectedTags = (array) $request->input('tags', []);
        $selectedLevels = (array) $request->input('levels', []);

        $tests = $this->allSavedTests();

        $allQuestionIds = $tests->flatMap(fn($t) => $t->question_ids ?? [])->unique();
        $questions = Question::with('tags')->whereIn('id', $allQuestionIds)->get()->keyBy('id');