app/Http/Controllers/PageManageController.php

    public function edit(Page $page)
    {
        $blocks = $page->textBlocks()
            ->orderBy('sort_order')
            ->orderBy('id')
            ->get();
---
select * from `text_blocks` where `text_blocks`.`page_id` = 124 and `text_blocks`.`page_id` is not null order by `sort_order` asc, `sort_order` asc, `id` asc

    protected function categories()
    {
        return PageCategory::query()->orderBy('title')->get();
---
select * from `page_categories` order by `title` asc