app/Http/Controllers/QuestionHelpController.php

    public function explain(Request $request, ChatGPTService $gpt)
    {
        $data = $request->validate([
            'question_id' => 'required|integer|exists:questions,id',
            'answer' => 'required|string',
            'test_slug' => 'sometimes|string',
            'correct_answer' => 'sometimes|string',
            'marker' => 'sometimes|string',
            'language' => 'sometimes|string',
        ]);

        $locale = $this->resolveRequestedLocale($request, $data['language'] ?? null);
        $question = Question::with('answers.option')->findOrFail($data['question_id']);
---
select * from `questions` where `questions`.`id` = 4725 limit 1

    private function findStoredExplanation(array $questionTexts, string $normalizedGiven, string $normalizedCorrect, string $locale, bool $isCorrect): ?string
    {
        if (empty($questionTexts) || $normalizedCorrect === '') {
            return null;
        }

        $languages = $this->preferredExplanationLanguages($locale);

        $baseQuery = ChatGPTExplanation::query()
            ->whereIn('question', $questionTexts)
            ->whereIn('language', $languages)
            ->whereRaw('LOWER(TRIM(correct_answer)) = ?', [$normalizedCorrect]);

        if ($normalizedGiven !== '') {
            $match = $this->selectPreferredExplanation(
                (clone $baseQuery)
                    ->whereRaw('LOWER(TRIM(wrong_answer)) = ?', [$normalizedGiven])
                    ->get(),
                $languages
            );
---
select * from `chatgpt_explanations` where `question` in ('If you {a1} to my birthday party tonight, I {a2} very upset. I want you to come!') and `language` in ('ua', 'uk') and LOWER(TRIM(correct_answer)) = 'don\'t come' and LOWER(TRIM(wrong_answer)) = 'am' limit 1