app/Http/Controllers/SeedRunController.php

    protected function assembleSeedRunOverview(): array
    {
        $tableExists = Schema::hasTable('seed_runs');
        $executedSeeders = collect();
        $pendingSeeders = collect();
        $executedSeederHierarchy = collect();
        $recentSeedRunOrdinals = collect();
        $recentThreshold = now()->subDay();

        if (! $tableExists) {
            return [
                'tableExists' => false,
                'executedSeeders' => $executedSeeders,
                'pendingSeeders' => $pendingSeeders,
                'executedSeederHierarchy' => $executedSeederHierarchy,
                'recentSeedRunOrdinals' => $recentSeedRunOrdinals,
            ];
        }

        $executedSeeders = DB::table('seed_runs')
            ->orderByDesc('ran_at')
            ->get()
            ->map(function ($seedRun) {
                $seedRun->ran_at = $seedRun->ran_at ? Carbon::parse($seedRun->ran_at) : null;
                $seedRun->display_class_name = $this->formatSeederClassName($seedRun->class_name);

                return $seedRun;
            });
---
select * from `seed_runs` order by `ran_at` desc

    protected function buildCategorySummaries(string $className): Collection
    {
        $questions = Question::query()
            ->with(['category:id,name', 'source:id,name'])
            ->where('seeder', $className)
            ->orderBy('id')
            ->get(['id', 'category_id', 'source_id']);

        return $questions
            ->groupBy(function (Question $question) {
                return optional($question->category)->name ?? __('Без категорії');
            })
            ->map(function (Collection $categoryQuestions, string $categoryName) {
                $categoryModel = optional($categoryQuestions->first()->category);
                $categoryId = $categoryModel?->id;
                $categoryKey = $this->makeCategoryKey($categoryId);

                $sources = $categoryQuestions
                    ->groupBy(function (Question $question) {
                        return optional($question->source)->name ?? __('Без джерела');
                    })
                    ->map(function (Collection $sourceQuestions, string $sourceName) {
                        $sourceModel = optional($sourceQuestions->first()->source);
                        $sourceId = $sourceModel?->id;

                        return [
                            'key' => $this->makeSourceKey($sourceId),
                            'source' => $sourceModel ? [
                                'id' => $sourceModel->id,
---
select * from `questions` where `seeder` in ('Database\\Seeders\\V2\\Modals\\ModalObligationNecessityV2Seeder') order by `id` asc limit 100