app/Http/Controllers/WordsTestController.php

    private function buildQuestionPayload(int $wordId, string $lang): ?array
    {
        $word = $this->wordsQuery($lang)->find($wordId);

        if (! $word) {
            return null;
        }

        $otherWords = $this->wordsQuery($lang)
            ->where('id', '!=', $wordId)
            ->inRandomOrder()
            ->take(4)
            ->get();
---
select * from `words` where `words`.`id` = 187 limit 1
select `word` from `words` where `id` != 187 order by RAND() limit 4